stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="APM Collect API Stress Test">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <stringProp name="TestPlan.comments">APM Collect API</stringProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="SERVER_HOST" elementType="Argument">
            <stringProp name="Argument.name">SERVER_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SERVER_PORT" elementType="Argument">
            <stringProp name="Argument.name">SERVER_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PATH" elementType="Argument">
            <stringProp name="Argument.name">PATH</stringProp>
            <stringProp name="Argument.value">/api/v1/collect</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage-1 Baseline (50 threads / 60s)" enabled="true">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <longProp name="ThreadGroup.duration">60</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Span JSON" enabled="true">
          <stringProp name="scriptLanguage">beanshell</stringProp>
          <stringProp name="cacheKey">false</stringProp>
          <stringProp name="script">import java.util.Random;
import java.text.SimpleDateFormat;
import java.util.TimeZone;

String randomHex(int len) {
    StringBuilder sb = new StringBuilder();
    Random r = new Random();
    for (int i = 0; i &lt; len; i++) {
        sb.append(Integer.toHexString(r.nextInt(16)));
    }
    return sb.toString();
}

SimpleDateFormat fmt = new SimpleDateFormat(&quot;yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;&quot;);
fmt.setTimeZone(TimeZone.getTimeZone(&quot;UTC&quot;));

String[] serviceNames = {&quot;gateway-service&quot;, &quot;user-service&quot;, &quot;order-service&quot;, &quot;payment-service&quot;, &quot;inventory-service&quot;, &quot;notification-service&quot;};
String[][] serviceOps = {
    {&quot;GET /api/users&quot;, &quot;GET /api/orders&quot;, &quot;POST /api/checkout&quot;, &quot;GET /api/products&quot;},
    {&quot;GET /users/{id}&quot;, &quot;POST /users/login&quot;, &quot;SELECT * FROM users&quot;},
    {&quot;GET /orders&quot;, &quot;POST /orders&quot;, &quot;SELECT * FROM orders&quot;},
    {&quot;POST /payments&quot;, &quot;GET /payments/{id}&quot;},
    {&quot;GET /inventory/{sku}&quot;, &quot;UPDATE inventory&quot;},
    {&quot;POST /notify/email&quot;, &quot;POST /notify/sms&quot;}
};

Random rand = new Random();
String traceId = randomHex(32);
int spanCount = Math.max(1, rand.nextInt(7) + 1);
StringBuilder json = new StringBuilder(&quot;[&quot;);
long now = System.currentTimeMillis();
String parentId = null;

for (int i = 0; i &lt; spanCount; i++) {
    int svcIdx = rand.nextInt(serviceNames.length);
    String svcName = serviceNames[svcIdx];
    String[] ops = serviceOps[svcIdx];
    String op = ops[rand.nextInt(ops.length)];
    int dur = Math.max(1, (int)(rand.nextGaussian() * 150 + 300));
    String spanId = randomHex(16);
    String startStr = fmt.format(new java.util.Date(now));
    String endStr = fmt.format(new java.util.Date(now + dur));

    if (i &gt; 0) json.append(&quot;,&quot;);
    json.append(&quot;{\&quot;traceId\&quot;:\&quot;&quot; + traceId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;spanId\&quot;:\&quot;&quot; + spanId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;parentSpanId\&quot;:&quot; + (parentId == null ? &quot;null&quot; : &quot;\&quot;&quot; + parentId + &quot;\&quot;&quot;));
    json.append(&quot;,\&quot;serviceName\&quot;:\&quot;&quot; + svcName + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;operationName\&quot;:\&quot;&quot; + op + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;startTime\&quot;:\&quot;&quot; + startStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;endTime\&quot;:\&quot;&quot; + endStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;duration\&quot;:&quot; + dur);
    json.append(&quot;,\&quot;statusCode\&quot;:200}&quot;);

    parentId = spanId;
    now = now + dur;
}
json.append(&quot;]&quot;);

vars.put(&quot;SPAN_JSON&quot;, json.toString());
vars.put(&quot;SPAN_COUNT&quot;, String.valueOf(spanCount));
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/collect" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${PATH}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${SPAN_JSON}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage-2 Medium (100 threads / 60s)" enabled="true">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <longProp name="ThreadGroup.duration">60</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Span JSON" enabled="true">
          <stringProp name="scriptLanguage">beanshell</stringProp>
          <stringProp name="cacheKey">false</stringProp>
          <stringProp name="script">import java.util.Random;
import java.text.SimpleDateFormat;
import java.util.TimeZone;

String randomHex(int len) {
    StringBuilder sb = new StringBuilder();
    Random r = new Random();
    for (int i = 0; i &lt; len; i++) {
        sb.append(Integer.toHexString(r.nextInt(16)));
    }
    return sb.toString();
}

SimpleDateFormat fmt = new SimpleDateFormat(&quot;yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;&quot;);
fmt.setTimeZone(TimeZone.getTimeZone(&quot;UTC&quot;));

String[] serviceNames = {&quot;gateway-service&quot;, &quot;user-service&quot;, &quot;order-service&quot;, &quot;payment-service&quot;, &quot;inventory-service&quot;, &quot;notification-service&quot;};
String[][] serviceOps = {
    {&quot;GET /api/users&quot;, &quot;GET /api/orders&quot;, &quot;POST /api/checkout&quot;, &quot;GET /api/products&quot;},
    {&quot;GET /users/{id}&quot;, &quot;POST /users/login&quot;, &quot;SELECT * FROM users&quot;},
    {&quot;GET /orders&quot;, &quot;POST /orders&quot;, &quot;SELECT * FROM orders&quot;},
    {&quot;POST /payments&quot;, &quot;GET /payments/{id}&quot;},
    {&quot;GET /inventory/{sku}&quot;, &quot;UPDATE inventory&quot;},
    {&quot;POST /notify/email&quot;, &quot;POST /notify/sms&quot;}
};

Random rand = new Random();
String traceId = randomHex(32);
int spanCount = Math.max(1, rand.nextInt(7) + 1);
StringBuilder json = new StringBuilder(&quot;[&quot;);
long now = System.currentTimeMillis();
String parentId = null;

for (int i = 0; i &lt; spanCount; i++) {
    int svcIdx = rand.nextInt(serviceNames.length);
    String svcName = serviceNames[svcIdx];
    String[] ops = serviceOps[svcIdx];
    String op = ops[rand.nextInt(ops.length)];
    int dur = Math.max(1, (int)(rand.nextGaussian() * 150 + 300));
    String spanId = randomHex(16);
    String startStr = fmt.format(new java.util.Date(now));
    String endStr = fmt.format(new java.util.Date(now + dur));

    if (i &gt; 0) json.append(&quot;,&quot;);
    json.append(&quot;{\&quot;traceId\&quot;:\&quot;&quot; + traceId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;spanId\&quot;:\&quot;&quot; + spanId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;parentSpanId\&quot;:&quot; + (parentId == null ? &quot;null&quot; : &quot;\&quot;&quot; + parentId + &quot;\&quot;&quot;));
    json.append(&quot;,\&quot;serviceName\&quot;:\&quot;&quot; + svcName + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;operationName\&quot;:\&quot;&quot; + op + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;startTime\&quot;:\&quot;&quot; + startStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;endTime\&quot;:\&quot;&quot; + endStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;duration\&quot;:&quot; + dur);
    json.append(&quot;,\&quot;statusCode\&quot;:200}&quot;);

    parentId = spanId;
    now = now + dur;
}
json.append(&quot;]&quot;);

vars.put(&quot;SPAN_JSON&quot;, json.toString());
vars.put(&quot;SPAN_COUNT&quot;, String.valueOf(spanCount));
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/collect" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${PATH}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${SPAN_JSON}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage-3 Heavy (200 threads / 60s)" enabled="true">
        <intProp name="ThreadGroup.num_threads">200</intProp>
        <intProp name="ThreadGroup.ramp_time">15</intProp>
        <longProp name="ThreadGroup.duration">60</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Span JSON" enabled="true">
          <stringProp name="scriptLanguage">beanshell</stringProp>
          <stringProp name="cacheKey">false</stringProp>
          <stringProp name="script">import java.util.Random;
import java.text.SimpleDateFormat;
import java.util.TimeZone;

String randomHex(int len) {
    StringBuilder sb = new StringBuilder();
    Random r = new Random();
    for (int i = 0; i &lt; len; i++) {
        sb.append(Integer.toHexString(r.nextInt(16)));
    }
    return sb.toString();
}

SimpleDateFormat fmt = new SimpleDateFormat(&quot;yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;&quot;);
fmt.setTimeZone(TimeZone.getTimeZone(&quot;UTC&quot;));

String[] serviceNames = {&quot;gateway-service&quot;, &quot;user-service&quot;, &quot;order-service&quot;, &quot;payment-service&quot;, &quot;inventory-service&quot;, &quot;notification-service&quot;};
String[][] serviceOps = {
    {&quot;GET /api/users&quot;, &quot;GET /api/orders&quot;, &quot;POST /api/checkout&quot;, &quot;GET /api/products&quot;},
    {&quot;GET /users/{id}&quot;, &quot;POST /users/login&quot;, &quot;SELECT * FROM users&quot;},
    {&quot;GET /orders&quot;, &quot;POST /orders&quot;, &quot;SELECT * FROM orders&quot;},
    {&quot;POST /payments&quot;, &quot;GET /payments/{id}&quot;},
    {&quot;GET /inventory/{sku}&quot;, &quot;UPDATE inventory&quot;},
    {&quot;POST /notify/email&quot;, &quot;POST /notify/sms&quot;}
};

Random rand = new Random();
String traceId = randomHex(32);
int spanCount = Math.max(1, rand.nextInt(7) + 1);
StringBuilder json = new StringBuilder(&quot;[&quot;);
long now = System.currentTimeMillis();
String parentId = null;

for (int i = 0; i &lt; spanCount; i++) {
    int svcIdx = rand.nextInt(serviceNames.length);
    String svcName = serviceNames[svcIdx];
    String[] ops = serviceOps[svcIdx];
    String op = ops[rand.nextInt(ops.length)];
    int dur = Math.max(1, (int)(rand.nextGaussian() * 150 + 300));
    String spanId = randomHex(16);
    String startStr = fmt.format(new java.util.Date(now));
    String endStr = fmt.format(new java.util.Date(now + dur));

    if (i &gt; 0) json.append(&quot;,&quot;);
    json.append(&quot;{\&quot;traceId\&quot;:\&quot;&quot; + traceId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;spanId\&quot;:\&quot;&quot; + spanId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;parentSpanId\&quot;:&quot; + (parentId == null ? &quot;null&quot; : &quot;\&quot;&quot; + parentId + &quot;\&quot;&quot;));
    json.append(&quot;,\&quot;serviceName\&quot;:\&quot;&quot; + svcName + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;operationName\&quot;:\&quot;&quot; + op + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;startTime\&quot;:\&quot;&quot; + startStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;endTime\&quot;:\&quot;&quot; + endStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;duration\&quot;:&quot; + dur);
    json.append(&quot;,\&quot;statusCode\&quot;:200}&quot;);

    parentId = spanId;
    now = now + dur;
}
json.append(&quot;]&quot;);

vars.put(&quot;SPAN_JSON&quot;, json.toString());
vars.put(&quot;SPAN_COUNT&quot;, String.valueOf(spanCount));
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/collect" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${PATH}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${SPAN_JSON}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage-4 Extreme (300 threads / 60s)" enabled="true">
        <intProp name="ThreadGroup.num_threads">300</intProp>
        <intProp name="ThreadGroup.ramp_time">15</intProp>
        <longProp name="ThreadGroup.duration">60</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Span JSON" enabled="true">
          <stringProp name="scriptLanguage">beanshell</stringProp>
          <stringProp name="cacheKey">false</stringProp>
          <stringProp name="script">import java.util.Random;
import java.text.SimpleDateFormat;
import java.util.TimeZone;

String randomHex(int len) {
    StringBuilder sb = new StringBuilder();
    Random r = new Random();
    for (int i = 0; i &lt; len; i++) {
        sb.append(Integer.toHexString(r.nextInt(16)));
    }
    return sb.toString();
}

SimpleDateFormat fmt = new SimpleDateFormat(&quot;yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;&quot;);
fmt.setTimeZone(TimeZone.getTimeZone(&quot;UTC&quot;));

String[] serviceNames = {&quot;gateway-service&quot;, &quot;user-service&quot;, &quot;order-service&quot;, &quot;payment-service&quot;, &quot;inventory-service&quot;, &quot;notification-service&quot;};
String[][] serviceOps = {
    {&quot;GET /api/users&quot;, &quot;GET /api/orders&quot;, &quot;POST /api/checkout&quot;, &quot;GET /api/products&quot;},
    {&quot;GET /users/{id}&quot;, &quot;POST /users/login&quot;, &quot;SELECT * FROM users&quot;},
    {&quot;GET /orders&quot;, &quot;POST /orders&quot;, &quot;SELECT * FROM orders&quot;},
    {&quot;POST /payments&quot;, &quot;GET /payments/{id}&quot;},
    {&quot;GET /inventory/{sku}&quot;, &quot;UPDATE inventory&quot;},
    {&quot;POST /notify/email&quot;, &quot;POST /notify/sms&quot;}
};

Random rand = new Random();
String traceId = randomHex(32);
int spanCount = Math.max(1, rand.nextInt(7) + 1);
StringBuilder json = new StringBuilder(&quot;[&quot;);
long now = System.currentTimeMillis();
String parentId = null;

for (int i = 0; i &lt; spanCount; i++) {
    int svcIdx = rand.nextInt(serviceNames.length);
    String svcName = serviceNames[svcIdx];
    String[] ops = serviceOps[svcIdx];
    String op = ops[rand.nextInt(ops.length)];
    int dur = Math.max(1, (int)(rand.nextGaussian() * 150 + 300));
    String spanId = randomHex(16);
    String startStr = fmt.format(new java.util.Date(now));
    String endStr = fmt.format(new java.util.Date(now + dur));

    if (i &gt; 0) json.append(&quot;,&quot;);
    json.append(&quot;{\&quot;traceId\&quot;:\&quot;&quot; + traceId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;spanId\&quot;:\&quot;&quot; + spanId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;parentSpanId\&quot;:&quot; + (parentId == null ? &quot;null&quot; : &quot;\&quot;&quot; + parentId + &quot;\&quot;&quot;));
    json.append(&quot;,\&quot;serviceName\&quot;:\&quot;&quot; + svcName + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;operationName\&quot;:\&quot;&quot; + op + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;startTime\&quot;:\&quot;&quot; + startStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;endTime\&quot;:\&quot;&quot; + endStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;duration\&quot;:&quot; + dur);
    json.append(&quot;,\&quot;statusCode\&quot;:200}&quot;);

    parentId = spanId;
    now = now + dur;
}
json.append(&quot;]&quot;);

vars.put(&quot;SPAN_JSON&quot;, json.toString());
vars.put(&quot;SPAN_COUNT&quot;, String.valueOf(spanCount));
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/collect" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${PATH}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${SPAN_JSON}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Stage-5 Limit (500 threads / 120s)" enabled="true">
        <intProp name="ThreadGroup.num_threads">500</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">120</longProp>
        <longProp name="ThreadGroup.delay">0</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Generate Span JSON" enabled="true">
          <stringProp name="scriptLanguage">beanshell</stringProp>
          <stringProp name="cacheKey">false</stringProp>
          <stringProp name="script">import java.util.Random;
import java.text.SimpleDateFormat;
import java.util.TimeZone;

String randomHex(int len) {
    StringBuilder sb = new StringBuilder();
    Random r = new Random();
    for (int i = 0; i &lt; len; i++) {
        sb.append(Integer.toHexString(r.nextInt(16)));
    }
    return sb.toString();
}

SimpleDateFormat fmt = new SimpleDateFormat(&quot;yyyy-MM-dd&apos;T&apos;HH:mm:ss.SSS&apos;Z&apos;&quot;);
fmt.setTimeZone(TimeZone.getTimeZone(&quot;UTC&quot;));

String[] serviceNames = {&quot;gateway-service&quot;, &quot;user-service&quot;, &quot;order-service&quot;, &quot;payment-service&quot;, &quot;inventory-service&quot;, &quot;notification-service&quot;};
String[][] serviceOps = {
    {&quot;GET /api/users&quot;, &quot;GET /api/orders&quot;, &quot;POST /api/checkout&quot;, &quot;GET /api/products&quot;},
    {&quot;GET /users/{id}&quot;, &quot;POST /users/login&quot;, &quot;SELECT * FROM users&quot;},
    {&quot;GET /orders&quot;, &quot;POST /orders&quot;, &quot;SELECT * FROM orders&quot;},
    {&quot;POST /payments&quot;, &quot;GET /payments/{id}&quot;},
    {&quot;GET /inventory/{sku}&quot;, &quot;UPDATE inventory&quot;},
    {&quot;POST /notify/email&quot;, &quot;POST /notify/sms&quot;}
};

Random rand = new Random();
String traceId = randomHex(32);
int spanCount = Math.max(1, rand.nextInt(7) + 1);
StringBuilder json = new StringBuilder(&quot;[&quot;);
long now = System.currentTimeMillis();
String parentId = null;

for (int i = 0; i &lt; spanCount; i++) {
    int svcIdx = rand.nextInt(serviceNames.length);
    String svcName = serviceNames[svcIdx];
    String[] ops = serviceOps[svcIdx];
    String op = ops[rand.nextInt(ops.length)];
    int dur = Math.max(1, (int)(rand.nextGaussian() * 150 + 300));
    String spanId = randomHex(16);
    String startStr = fmt.format(new java.util.Date(now));
    String endStr = fmt.format(new java.util.Date(now + dur));

    if (i &gt; 0) json.append(&quot;,&quot;);
    json.append(&quot;{\&quot;traceId\&quot;:\&quot;&quot; + traceId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;spanId\&quot;:\&quot;&quot; + spanId + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;parentSpanId\&quot;:&quot; + (parentId == null ? &quot;null&quot; : &quot;\&quot;&quot; + parentId + &quot;\&quot;&quot;));
    json.append(&quot;,\&quot;serviceName\&quot;:\&quot;&quot; + svcName + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;operationName\&quot;:\&quot;&quot; + op + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;startTime\&quot;:\&quot;&quot; + startStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;endTime\&quot;:\&quot;&quot; + endStr + &quot;\&quot;&quot;);
    json.append(&quot;,\&quot;duration\&quot;:&quot; + dur);
    json.append(&quot;,\&quot;statusCode\&quot;:200}&quot;);

    parentId = spanId;
    now = now + dur;
}
json.append(&quot;]&quot;);

vars.put(&quot;SPAN_JSON&quot;, json.toString());
vars.put(&quot;SPAN_COUNT&quot;, String.valueOf(spanCount));
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/v1/collect" enabled="true">
          <intProp name="HTTPSampler.connect_timeout">5000</intProp>
          <intProp name="HTTPSampler.response_timeout">10000</intProp>
          <stringProp name="HTTPSampler.domain">${SERVER_HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${PATH}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${SPAN_JSON}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>